{
  "recipes": [
    {
      "number": 1,
      "type": "chicken",
      "name": "Chicken Noodle Soup",
      "imgSource": "/chicken-noodle-soup.jpg",
      "ingredients": [
        "1 tablespoon olive oil",
        "1 large onion diced",
        "4 cloves garlic minced",
        "2 large carrots chopped",
        "1 rib celery chopped",
        "6 skinless chicken thighs, bone in (or 8 legs)",
        "2 quarts (litres) chicken stock or broth",
        "1-2 chicken bouillon cubes, crushed (adjust to your tastes)",
        "7 oz (200 g) green beans, chopped in thirds",
        "3/4 cup corn kernels",
        "4 oz (120 g) baby spinach leaves",
        "1/2 quart (litre) of water, as needed",
        "6 oz (200 g) vermicelli or egg noodles (or angel hair pasta)",
        "Salt and pepper, to taste",
        "1/4 cup fresh parsley, finely chopped"
      ],
      "preparationTime": "45 mins",
      "instructions": [
        "Heat oil in a large pot over medium heat. Cook onion for 2 minutes, then add garlic, celery and carrots;cook for 5 minutes.",
        "Add the chicken thighs, broth (stock), crushed bouillon, green beans and corn kernels. Top up with water if needed to cover all of the ingredients.",
        "Increase heat and bring to a boil for about 4 minutes. Reduce heat, partially cover the pot with a lid, and allow to simmer for 20 minutes or until the chicken is cooked through.",
        "Transfer chicken to a plate and shred the meat; discard the bones.",
        "Add the chicken back into the soup along with the noodles. Cover and cook for 6-8 minutes while stirring occasionally to separate noodles.",
        "Stir in the spinach leaves and allow to wilt in the soup (about 3 minutes, pressing leaves into the liquid with the tip of a wooden spoon). Mix parsley through. Season with salt and pepper, to taste. ",
        "Serve warm"
      ]
    },
    {
      "number": 2,
      "type": "chicken ",
      "name": "Chicken Osso-Buco ",
      "imgSource": "/osso-buco.jpg ",
      "ingredients": [
        "1/4 c. all-purpose flour",
        "2 tsp. olive oil",
        "1 large onion",
        "2 medium carrots",
        "1 small bulb fennel, chopped, or 2 medium stalks celery",
        "3/4 c. dry white wine",
        "1 can low-sodium chicken broth",
        "1 can diced tomatoes",
        "1 1/2 tsp. chopped fresh rosemary or 1⁄2 tsp dried rosemary",
        "Kosher salt and pepper",
        "1 c. orzo",
        "1/2 c. flat-leaf parsley",
        "1 tbsp. grated lemon zest"
      ],
      "preparationTime": " 45 mins ",
      "instructions": [
        "Heat oven to 325ºF. In a large resealable plastic bag, place the flour and the chicken pieces and shake to coat. Heat the oil in a large ovenproof skillet over medium-high heat. Add the chicken and cook, turning occasionally until browned, about 8 minutes. Transfer the chicken to plate.",
        "Reduce the heat to medium. Add the onion, carrots, fennel and 2 tsp of the garlic to the saucepan and cook,covered,stirring occasionally, until golden brown and tender, 5 to 7 minutes. Add the wine and cook, stirring and scraping up any brown bits for 1 minute.",
        "Add the chicken broth, tomatoes, rosemary, 1/2 tsp salt and 1/4 tsp pepper and simmer for 4 minutes.",
        "Return chicken to pan, cover and bake until the chicken is cooked through, 30 to 40 minutes.",
        "Meanwhile, cook the orzo according to package directions. In a small bowl, combine the parsley, lemon zest and the remaining garlic. Sprinkle chicken with parsley mixture and serve with cooked orzo."
      ]
    },
    {
      "number": 3,
      "type": "onion ",
      "name": "French Onion Beef Noodle Soup",
      "imgSource": "/french-noodles.jpg",
      "ingredients": [
        "2 Tbsp. vegetable oil",
        "3 lb. English-style bone-in beef short ribs, cut into 2\" segments",
        "Kosher salt",
        "6 scallions, white and dark green parts separated",
        "8 garlic cloves",
        "1 4\" piece ginger, scrubbed, thinly sliced",
        "6 star anise pods",
        "2 3\" cinnamon sticks",
        "8 whole cloves",
        "2 tsp. black peppercorns",
        "2 tsp. coriander seeds",
        "1 cup dry white wine",
        "½ cup (or more) low-sodium soy sauce",
        "3 Tbsp. unsalted butter",
        "5 lb. onions (about 10 medium), thinly sliced",
        "2 Tbsp. (or more) unseasoned rice vinegar",
        "30 oz. fresh or 18 oz. dried ramen noodles"
      ],
      "preparationTime": " 45 mins ",
      "instructions": [
        "Heat oil in a large Dutch oven or other heavy pot over medium-high. Season short ribs with salt and, working in batches, cook, turning occasionally, until well browned on all sides, 12–14 minutes. Transfer to a platter as you go. Carefully pour off fat left behind in pot until there is just enough to cover bottom of pot; discard.",
        "Return pot to medium heat. Cook whole white scallion parts, garlic, and ginger, stirring occasionally, until they are starting to brown, about 4 minutes. Add star anise, cinnamon, cloves, peppercorns, and coriander seeds and cook, stirring often, until fragrant and oil is sizzling, about 1 minute. Add wine, scraping up any browned bits from bottom of pot with a wooden spoon. Simmer until almost completely evaporated, about 3 minutes. Return beef to pot and add soy sauce and 12 cups water. Bring to a boil, then reduce heat and cover partially with a lid. Simmer until meat is not quite falling off the bone, about 1½ hours.",
        "Meanwhile, heat butter in another large pot or Dutch oven over medium-high until foaming subsides. Add onions, season with salt, and cook, stirring often, until they begin to take on some color, about 15 minutes. (If they don’t fit in your pot, add as much as you can, cover, and steam 5 minutes. Stir in remaining onions and continue cooking.) Reduce heat to medium-low and cook, stirring occasionally, until onions are deep golden and softened but not mushy, 30–45 minutes.",
        "Using tongs, remove beef from broth and let cool until you can handle. Tear meat into bite-size pieces, discarding any bone and excess fat as you go. Strain broth through a fine-mesh sieve into a large bowl; discard solids.",
        "Add meat and broth to pot with onions. Bring to a boil, reduce heat to low, and simmer until liquid is reduced a bit and flavors have melded, about 30 minutes. Add vinegar; taste and add more vinegar and/or soy sauce if needed. ",
        " Thinly slice remaining scallion greens. Cook noodles according to package directions. Divide among bowls. Ladle soup over noodles, making sure each bowl gets some meat and plenty of onions. Top with scallion greens and serve."
      ]
    },
    {
      "number": 4,
      "type": "onion ",
      "name": "Polish Haluski Recipe ",
      "imgSource": "/haluski-noodle.jpg ",
      "ingredients": [
        "1 onion (very large and sliced into rounds)",
        "8 ounces butter (divided)",
        "1 large head cabbage (cut into 1-inch pieces)",
        "Salt (to taste)",
        "Freshly ground black pepper (to taste)",
        "8 ounces egg noodles (1/2-inch wide, cooked)"
      ],
      "preparationTime": "45 mins ",
      "instructions": [
        "Cut the round onion slices in half and then in half again so each round yields four pieces.",
        "In a large skillet or Dutch oven, sauté onion in 4 ounces of butter, stirring frequently, over low heat until very lightly caramelized. This could take 15 minutes or more.",
        "Do not cover. Sauté slowly, stirring frequently, over low heat until cabbage is tender, but not brown (cook to al dentestage if baking in the oven). This could take 30 minutes or more. ",
        "If using the stovetop method, combine onion-cabbage mixture with 8 ounces cooked noodles, mixing well. Adjust seasonings and serve."
      ]
    }
  ]
}
